#create_clock -name {clk} -period 6  [get_ports {SMA_CLKIN}]
create_clock -name {CLOCK_50} -period 10 -waveform { 0 5} [get_ports {CLOCK_50}]
create_clock -period 2 clk_fast
create_clock -period 4 clk_slow_even
create_clock -period 4 clk_slow_odd
#create_generated_clock -name spi_clock -source [get_ports {CLOCK_50}] -divide_by 3 [get_pins {s1|CLOCK_17M|q}]
#set_multicycle_path -from [get_cells {clock_gate_from_fsm*}] -setup -end 3
#set_multicycle_path -from [get_cells {clock_gate_from_fsm*}] -hold -end 2

#set_max_delay -to [get_cells -compatibility_mode *inst_mem\|in_fast*] 0.2
#set_max_delay -from [get_registers {all_mem_CDC:mem_and_testing0|memory_and_tester_with_cdc:mem[*].inst_mem|ram_1_port:memory|altsyncram:altsyncram_component|altsyncram_86i1:auto_generated|*}] -to [get_registers {all_mem_CDC:mem_and_testing0|memory_and_tester_with_cdc:mem[*].inst_mem|ram_1_port:memory|altsyncram:altsyncram_component|altsyncram_86i1:auto_generated|*}] 3.184

#derive_pll_clocks

